# Modern replacements for traditional Unix commands
brew "bat"            # Modern cat replacement with syntax highlighting
brew "eza"            # Modern ls replacement with icons and git integration
brew "fd"             # Modern find replacement with better syntax
brew "ripgrep"        # Modern grep replacement with better speed and features
brew "zoxide"         # Smart cd command that learns your habits
brew "delta"          # Better git diff with syntax highlighting
brew "duf"            # Better disk usage viewer
brew "dust"           # More intuitive version of du
brew "bottom"         # Yet another cross-platform graphical process/system monitor

# Fuzzy finder and shell improvements
brew "fzf"            # Fuzzy finder for files, history, and more
brew "sheldon"        # Plugin manager for zsh
brew "starship"       # Cross-shell customizable prompt

# Development tools
brew "gh"             # GitHub CLI for repository management
brew "git"            # Version control system
brew "lazygit"        # Terminal UI for git commands
brew "jq"             # JSON processor for command line
brew "yq"             # YAML processor (like jq but for YAML)
brew "difftastic"     # Syntax-aware diff tool
brew "bind"           # Contains dig command for DNS lookups
brew "n"              # Node version manager

# System monitoring and process management
brew "htop"           # Interactive process viewer
brew "btop"           # Resource monitor that shows usage and stats
brew "tldr"           # Simplified man pages with practical examples
brew "gping"          # Ping with graph

# Container and cloud tools
brew "docker"         # Container runtime
brew "kubectl"        # Kubernetes CLI
brew "k9s"           # Kubernetes CLI UI
brew "helm"          # Kubernetes package manager
