# Modern replacements for traditional Unix commands
brew "bat"            # Modern cat replacement with syntax highlighting
brew "eza"            # Modern ls replacement with icons and git integration
brew "fd"             # Modern find replacement with better syntax
brew "ripgrep"        # Modern grep replacement with better speed and features
brew "zoxide"         # Smart cd command that learns your habits
brew "git-delta"      # Better git diff with syntax highlighting
brew "duf"            # Better disk usage viewer
brew "dust"           # More intuitive version of du
brew "bottom"         # Yet another cross-platform graphical process/system monitor
brew "scc"            # Count lines of code

# Fuzzy finder and shell improvements
brew "fzf"            # Fuzzy finder for files, history, and more
brew "sheldon"        # Plugin manager for zsh
brew "starship"       # Cross-shell customizable prompt
brew "fish"           # User-friendly command line shell
brew "zsh-syntax-highlighting" # Fish shell-like syntax highlighting for Zsh

# Development tools
brew "gh"             # GitHub CLI for repository management
brew "git"            # Version control system
brew "lazygit"        # Terminal UI for git commands
brew "lazydocker"     # Terminal UI for docker
brew "gitui"          # Terminal UI for git
brew "jq"             # JSON processor for command line
brew "yq"             # YAML processor (like jq but for YAML)
brew "difftastic"     # Syntax-aware diff tool
brew "bind"           # Contains dig command for DNS lookups
brew "yarn"           # Package manager for Node.js
brew "biome"          # Development environment manager
brew "mise"           # Version Manager for Everything (node,rust,go,etc.)
brew "mprocs"         # Process multiplexer start multiple processes

# System monitoring and process management
brew "htop"           # Interactive process viewer
brew "btop"           # Resource monitor that shows usage and stats
brew "tldr"           # Simplified man pages with practical examples
brew "gping"          # Ping with graph
brew "speedtest-cli"  # Command line speed test utility
brew "hyperfine"      # Benchmarking tool for command-line

# Container and cloud tools
brew "docker"         # Container runtime
brew "orbstack"       # Docker alternative
brew "helm"           # Kubernetes package manager

# Network and system utilities
brew "wget"           # Internet file retriever
brew "telnet"         # User interface to TELNET protocol
brew "hudochenkov/sshpass/sshpass" # Tool for non-interactive ssh password auth
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu" # Cross compilation toolchain

# GUI Applications (Casks)
cask "aldente"                  # Battery charge limiter
cask "anydesk"                 # Remote desktop software
cask "betterdisplay"           # Display management tool
cask "font-hack-nerd-font"     # Patched font for development
cask "git-credential-manager"  # Secure Git credential storage
cask "gitkraken"               # Git GUI client
cask "multitouch"              # Trackpad gesture customization
cask "pgadmin4"                # PostgreSQL administration tool
cask "raycast"                 # Productivity tool
cask "soundsource"             # Audio control utility
cask "stats"                   # System monitor menubar
cask "steam"                   # Gaming platform
cask "stremio"                 # Media center
cask "teamviewer"              # Remote access software
cask "textsniper"              # OCR tool
cask "tunnelblick"             # OpenVPN client
cask "vlc"                     # Media player
cask "warp"                    # Modern terminal
cask "zed"                     # Code editor
cask "boosteroid"              # Game streaming service
cask "nvidia-geforce-now"      # Game streaming service
cask "arc"                     # Modern browser
